% ===========================================
% 全局优化引论, 
% R. Horst, P.M. Pardalos, N.V. Thoai 著, 
% 清华大学出版社, 
% P135
% 测试 gamma_extension 子函数
% =========================================

clc ;
clear ;
close all ;
% =====================================================
fprintf( 'test 1 ==============================\n' ) ;
% =====================================================

x      = [ 0 ; 0 ; ] ;                   % 扩张起点
d      = [ 1 ; 1 ; ] ;                   % 扩张方向
gamma  = -4 ;                            % 当前最好目标值
oracle = @(x) -( x(1) + x(2) - 1 )^2 ;   % 目标函数
[ y, theta ] = gamma_extension( gamma, x, d, oracle )

clear ;
close all ;
% =====================================================
fprintf( 'test 2 ==============================\n' ) ;
% =====================================================
x     = [ 0 ; 1 ; ] ;
d     = [ 1 ; 1 ; ] ;
gamma = 1 - exp( -1 ) ;
oracle = @(x) 1 - exp( -( x(1) + x(2) ) ) ;
[ y, theta ] = gamma_extension( gamma, x, d, oracle )



